backend/tests/reports/consume_perf_2026-08-09.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: backend/tests/perf/baseline_consume.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 45s max duration (incl. graceful stop):
              * default: 10 looping VUs for 15s (gracefulStop: 30s)


running (01.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   7% ] 10 VUs  01.0s/15s

running (02.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [  13% ] 10 VUs  02.0s/15s

running (03.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  03.0s/15s

running (04.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default   [  27% ] 10 VUs  04.0s/15s

running (05.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default   [  33% ] 10 VUs  05.0s/15s

running (06.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  06.0s/15s

running (07.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
default   [  47% ] 10 VUs  07.0s/15s

running (08.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
default   [  53% ] 10 VUs  08.0s/15s

running (09.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  09.0s/15s

running (10.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
default   [  67% ] 10 VUs  10.0s/15s

running (11.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
default   [  73% ] 10 VUs  11.0s/15s

running (12.0s), 10/10 VUs, 60 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  12.0s/15s

running (13.0s), 10/10 VUs, 60 complete and 0 interrupted iterations
default   [  87% ] 10 VUs  13.0s/15s

running (14.0s), 10/10 VUs, 70 complete and 0 interrupted iterations
default   [  93% ] 10 VUs  14.0s/15s

running (15.0s), 10/10 VUs, 70 complete and 0 interrupted iterations
default   [ 100% ] 10 VUs  15.0s/15s


  █ THRESHOLDS 

    http_req_duration
    ✗ 'p(95)<800' p(95)=1.73s

    http_req_failed
    ✓ 'rate<0.10' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 80      5.311706/s
    checks_succeeded...: 100.00% 80 out of 80
    checks_failed......: 0.00%   0 out of 80

    ✓ consume dry-run 200

    HTTP
    http_req_duration..............: avg=1.68s min=1.65s med=1.67s max=1.74s p(90)=1.73s p(95)=1.73s
      { expected_response:true }...: avg=1.68s min=1.65s med=1.67s max=1.74s p(90)=1.73s p(95)=1.73s
    http_req_failed................: 0.00% 0 out of 80
    http_reqs......................: 80    5.311706/s

    EXECUTION
    iteration_duration.............: avg=1.88s min=1.85s med=1.87s max=1.94s p(90)=1.94s p(95)=1.94s
    iterations.....................: 80    5.311706/s
    vus............................: 10    min=10      max=10
    vus_max........................: 10    min=10      max=10

    NETWORK
    data_received..................: 54 kB 3.6 kB/s
    data_sent......................: 20 kB 1.3 kB/s



running (15.1s), 00/10 VUs, 80 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  15s
time="2026-08-09T13:30:40+08:00" level=error msg="thresholds on metrics 'http_req_duration' have been crossed"